In [2]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn as rn

# np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']


df = pd.DataFrame(matrix_data,row_labels,column_headings)
# print("\nThe data frame looks like\n", '-'*45, sep='')
df

          W         X         Y         Z
A -1.579191  2.889126  0.979962  0.729728
B  1.096718 -0.030837 -1.718565 -0.759898
C  0.109448 -0.652599 -1.042953  2.649488
D  0.567106  0.395445  0.011981  1.157927
E -0.219737 -0.130019  0.772291  1.160688

In [17]:
from numpy.random import randn as rn

#np.random.seed(101)
matrix_data = rn(5,4)
matrix_data

array([[-0.19183555, -0.88762896, -0.74715829,  1.6924546 ],
       [ 0.05080775, -0.63699565,  0.19091548,  2.10025514],
       [ 0.12015895,  0.61720311,  0.30017032, -0.35224985],
       [-1.1425182 , -0.34934272, -0.20889423,  0.58662319],
       [ 0.83898341,  0.93110208,  0.28558733,  0.88514116]])

In [18]:
## seed will gets the same data everytime

In [23]:
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(matrix_data,row_labels,column_headings)
df

          W         X         Y         Z
A -0.191836 -0.887629 -0.747158  1.692455
B  0.050808 -0.636996  0.190915  2.100255
C  0.120159  0.617203  0.300170 -0.352250
D -1.142518 -0.349343 -0.208894  0.586623
E  0.838983  0.931102  0.285587  0.885141

In [26]:
df[["X",'Z']]

          X         Z
A -0.887629  1.692455
B -0.636996  2.100255
C  0.617203 -0.352250
D -0.349343  0.586623
E  0.931102  0.885141

In [27]:
df.loc['E']

W    0.838983
X    0.931102
Y    0.285587
Z    0.885141
Name: E, dtype: float64

In [28]:
type(df.loc['E'])

pandas.core.series.Series

In [30]:
## default index of extract data
df.iloc[4]   ## iloc: integer location

W    0.838983
X    0.931102
Y    0.285587
Z    0.885141
Name: E, dtype: float64

In [31]:
from numpy.random import randn as rn

# np.random.seed(101)
matrix_data = rn(5,4)
row_labels = [12,23,32,22,21]
column_headings = ['W','X','Y','Z']


df = pd.DataFrame(matrix_data,row_labels,column_headings)
# print("\nThe data frame looks like\n", '-'*45, sep='')
df

           W         X         Y         Z
12 -0.754398  1.252868  0.512930 -0.298093
23  0.488518 -0.075572  1.131629  1.519817
32  2.185575 -1.396496 -1.444114 -0.504466
22  0.160037  0.876169  0.315635 -2.022201
21 -0.306204  0.827975  0.230095  0.762011

In [33]:
df.iloc[4]

W   -0.306204
X    0.827975
Y    0.230095
Z    0.762011
Name: 21, dtype: float64

In [35]:
df.iloc[21]   ## iloc: takes only default index

IndexError: single positional indexer is out-of-bounds

In [38]:
df.loc[21]   ## loc: takes only in location in name

W   -0.306204
X    0.827975
Y    0.230095
Z    0.762011
Name: 21, dtype: float64

In [39]:
from numpy.random import randn as rn

# np.random.seed(101)
matrix_data = rn(5,4)
row_labels = [12,23,32,23,32]
column_headings = ['W','X','Y','Z']


df = pd.DataFrame(matrix_data,row_labels,column_headings)
# print("\nThe data frame looks like\n", '-'*45, sep='')
df

           W         X         Y         Z
12 -0.222328 -0.200758  0.186561  0.410052
23  0.198300  0.119009 -0.670662  0.377564
32  0.121821  1.129484  1.198918  0.185156
23 -0.375285 -0.638730  0.423494  0.077340
32 -0.343854  0.043597 -0.620001  0.698032

In [40]:
df.loc[32]

           W         X         Y         Z
32  0.121821  1.129484  1.198918  0.185156
32 -0.343854  0.043597 -0.620001  0.698032

In [41]:
df.iloc[3]

W   -0.375285
X   -0.638730
Y    0.423494
Z    0.077340
Name: 23, dtype: float64

In [42]:
df

           W         X         Y         Z
12 -0.222328 -0.200758  0.186561  0.410052
23  0.198300  0.119009 -0.670662  0.377564
32  0.121821  1.129484  1.198918  0.185156
23 -0.375285 -0.638730  0.423494  0.077340
32 -0.343854  0.043597 -0.620001  0.698032

In [44]:
df.loc[[12,32]]

           W         X         Y         Z
12 -0.222328 -0.200758  0.186561  0.410052
32  0.121821  1.129484  1.198918  0.185156
32 -0.343854  0.043597 -0.620001  0.698032

In [46]:
df.iloc[[4,1,2]]

           W         X         Y         Z
32 -0.343854  0.043597 -0.620001  0.698032
23  0.198300  0.119009 -0.670662  0.377564
32  0.121821  1.129484  1.198918  0.185156

In [51]:
df

           W         X         Y         Z
12 -0.222328 -0.200758  0.186561  0.410052
23  0.198300  0.119009 -0.670662  0.377564
32  0.121821  1.129484  1.198918  0.185156
23 -0.375285 -0.638730  0.423494  0.077340
32 -0.343854  0.043597 -0.620001  0.698032

In [50]:
## to extract row and column both at a time

df.iloc[[4,1,2],[1]]

           X
32  0.043597
23  0.119009
32  1.129484

In [53]:
df.iloc[[1,2],[1,2]]

           X         Y
23  0.119009 -0.670662
32  1.129484  1.198918

In [54]:
df.loc[[23,32],['X',"Y"]]

           X         Y
23  0.119009 -0.670662
23 -0.638730  0.423494
32  1.129484  1.198918
32  0.043597 -0.620001

In [55]:
df

           W         X         Y         Z
12 -0.222328 -0.200758  0.186561  0.410052
23  0.198300  0.119009 -0.670662  0.377564
32  0.121821  1.129484  1.198918  0.185156
23 -0.375285 -0.638730  0.423494  0.077340
32 -0.343854  0.043597 -0.620001  0.698032

In [59]:
df.iloc[[0,4],[0,3]]

           W         Z
12 -0.222328  0.410052
32 -0.343854  0.698032

In [60]:
df.iloc[[0,-1],[0,-1]]

           W         Z
12 -0.222328  0.410052
32 -0.343854  0.698032

In [61]:
df

           W         X         Y         Z
12 -0.222328 -0.200758  0.186561  0.410052
23  0.198300  0.119009 -0.670662  0.377564
32  0.121821  1.129484  1.198918  0.185156
23 -0.375285 -0.638730  0.423494  0.077340
32 -0.343854  0.043597 -0.620001  0.698032

In [69]:
df.loc[[12,32],"W":"Y"]

           W         X         Y
12 -0.222328 -0.200758  0.186561
32  0.121821  1.129484  1.198918
32 -0.343854  0.043597 -0.620001

In [94]:
from numpy.random import randn as rn
#  np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ["W","X","Y","Z","E"]
column_values = ["R","A",'V','I']

df = pd.DataFrame(matrix_data,row_labels,column_values)

In [95]:
df

          R         A         V         I
W -0.186570 -0.101746  0.868886  0.750412
X  0.529465  0.137701  0.077821  0.618380
Y  0.232495  0.682551 -0.310117 -2.434838
Z  1.038825  2.186980  0.441364 -0.100155
E -0.136445 -0.119054  0.017409 -1.122019

In [96]:
df.drop('A')

KeyError: "['A'] not found in axis"

In [97]:
df.drop("A",axis=1)   ## to drop just for an instance

          R         V         I
W -0.186570  0.868886  0.750412
X  0.529465  0.077821  0.618380
Y  0.232495 -0.310117 -2.434838
Z  1.038825  0.441364 -0.100155
E -0.136445  0.017409 -1.122019

In [98]:
df

          R         A         V         I
W -0.186570 -0.101746  0.868886  0.750412
X  0.529465  0.137701  0.077821  0.618380
Y  0.232495  0.682551 -0.310117 -2.434838
Z  1.038825  2.186980  0.441364 -0.100155
E -0.136445 -0.119054  0.017409 -1.122019

In [99]:
## to drop permanently
df.drop("A",axis=1,inplace=True)

In [100]:
df

          R         V         I
W -0.186570  0.868886  0.750412
X  0.529465  0.077821  0.618380
Y  0.232495 -0.310117 -2.434838
Z  1.038825  0.441364 -0.100155
E -0.136445  0.017409 -1.122019

In [103]:
## to drop a row  for an instance
df.drop("Y")

          R         V         I
W -0.186570  0.868886  0.750412
X  0.529465  0.077821  0.618380
Z  1.038825  0.441364 -0.100155
E -0.136445  0.017409 -1.122019

In [104]:
df

          R         V         I
W -0.186570  0.868886  0.750412
X  0.529465  0.077821  0.618380
Y  0.232495 -0.310117 -2.434838
Z  1.038825  0.441364 -0.100155
E -0.136445  0.017409 -1.122019

In [105]:
df.drop("E")

          R         V         I
W -0.186570  0.868886  0.750412
X  0.529465  0.077821  0.618380
Y  0.232495 -0.310117 -2.434838
Z  1.038825  0.441364 -0.100155

In [106]:
df

          R         V         I
W -0.186570  0.868886  0.750412
X  0.529465  0.077821  0.618380
Y  0.232495 -0.310117 -2.434838
Z  1.038825  0.441364 -0.100155
E -0.136445  0.017409 -1.122019

In [107]:
## to drop permanently
df.drop("E",inplace=True)

In [108]:
df

          R         V         I
W -0.186570  0.868886  0.750412
X  0.529465  0.077821  0.618380
Y  0.232495 -0.310117 -2.434838
Z  1.038825  0.441364 -0.100155

In [110]:
df.drop(0)

KeyError: '[0] not found in axis'

In [114]:
## to add columns of the data

df["New"] = df["R"] + df["I"]
df["New(sum of r and i)"] = df["R"] + df["I"]

In [115]:
df

          R         V         I       New  New(sum of r and i)
W -0.186570  0.868886  0.750412  0.563842             0.563842
X  0.529465  0.077821  0.618380  1.147846             1.147846
Y  0.232495 -0.310117 -2.434838 -2.202343            -2.202343
Z  1.038825  0.441364 -0.100155  0.938669             0.938669

In [117]:
df.ix[["Z"]]

C:\Users\PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          R         V         I       New  New(sum of r and i)
Z  1.038825  0.441364 -0.100155  0.938669             0.938669

In [119]:
df.ix[["Y","W"]]

C:\Users\PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          R         V         I       New  New(sum of r and i)
Y  0.232495 -0.310117 -2.434838 -2.202343            -2.202343
W -0.186570  0.868886  0.750412  0.563842             0.563842

In [120]:
## ix is nothing but some how it is combination of rows and columns means loc and iloc

In [122]:
df.ix[0:2,1:3]

C:\Users\PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\PC\Anaconda3\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

          V         I
W  0.868886  0.750412
X  0.077821  0.618380

In [123]:
## axis = 0 means row and axis = 1 means column

In [124]:
## condition filtering of data to extract from the data set

In [128]:
print(' where we are checking the data based on conditional basis')
df>0   ## means it gives true or false one

 where we are checking the data based on conditional basis

       R      V      I    New  New(sum of r and i)
W  False   True   True   True                 True
X   True   True   True   True                 True
Y   True  False  False  False                False
Z   True   True  False   True                 True

In [132]:
print(df.loc[["W","Z"]]>0)

       R     V      I   New  New(sum of r and i)
W  False  True   True  True                 True
Z   True  True  False  True                 True

In [134]:
df[df.loc[["W","Z"]]>0]   ## it filters the data wherever having false it gives NaN value

          R         V         I       New  New(sum of r and i)
W       NaN  0.868886  0.750412  0.563842             0.563842
X       NaN       NaN       NaN       NaN                  NaN
Y       NaN       NaN       NaN       NaN                  NaN
Z  1.038825  0.441364       NaN  0.938669             0.938669

In [142]:
import pandas as pd
import numpy as np

matrix_data = np.matrix('23,34,4;5,56,7;88,9,999;00,99,99;87,66,55')
row_labels = ["A",'B','C','D','E']
column_headings = ["age","height","weight"]
matrix_data

matrix([[ 23,  34,   4],
        [  5,  56,   7],
        [ 88,   9, 999],
        [  0,  99,  99],
        [ 87,  66,  55]])

In [143]:
## to convert matrix data into dataframe
df = pd.DataFrame(matrix_data,row_labels,column_headings)
df

   age  height  weight
A   23      34       4
B    5      56       7
C   88       9     999
D    0      99      99
E   87      66      55

In [145]:
df["height"]>66

A    False
B    False
C    False
D     True
E    False
Name: height, dtype: bool

In [146]:
df["height"]<9

A    False
B    False
C    False
D    False
E    False
Name: height, dtype: bool

In [148]:
## To get all the records in a row
df[df["height"]>9]

   age  height  weight
A   23      34       4
B    5      56       7
D    0      99      99
E   87      66      55

In [165]:
df[(df["age"] > 5) & (df["height"] < 56) & (df["weight"]<7)]

   age  height  weight
A   23      34       4

In [169]:
df

   age  height  weight
A   23      34       4
B    5      56       7
C   88       9     999
D    0      99      99
E   87      66      55

In [170]:
## to change the row indexes

df.reset_index()

  index  age  height  weight
0     A   23      34       4
1     B    5      56       7
2     C   88       9     999
3     D    0      99      99
4     E   87      66      55

In [171]:
df

   age  height  weight
A   23      34       4
B    5      56       7
C   88       9     999
D    0      99      99
E   87      66      55

In [173]:
## to change the row index permeanently
df.reset_index(drop=True)

   age  height  weight
0   23      34       4
1    5      56       7
2   88       9     999
3    0      99      99
4   87      66      55

In [175]:
df

   age  height  weight
A   23      34       4
B    5      56       7
C   88       9     999
D    0      99      99
E   87      66      55

In [176]:
## to change the row index permeanently
df.reset_index(drop=True,inplace=True)

In [177]:
df

   age  height  weight
0   23      34       4
1    5      56       7
2   88       9     999
3    0      99      99
4   87      66      55

In [178]:
"student teacher engineer doctor nurse".split()

['student', 'teacher', 'engineer', 'doctor', 'nurse']

In [179]:
df["xyz"] = "student teacher engineer doctor nurse".split()

In [180]:
df

   age  height  weight       xyz
0   23      34       4   student
1    5      56       7   teacher
2   88       9     999  engineer
3    0      99      99    doctor
4   87      66      55     nurse

In [182]:
## to get the column as a index
print("adding a new column profession")
df["profession"] = "student teacher engineer doctor nurse".split()
df

adding a new column profession

   age  height  weight       xyz profession
0   23      34       4   student    student
1    5      56       7   teacher    teacher
2   88       9     999  engineer   engineer
3    0      99      99    doctor     doctor
4   87      66      55     nurse      nurse

In [184]:
## setting xyz column as a index
df.set_index("xyz")

          age  height  weight profession
xyz
student    23      34       4    student
teacher     5      56       7    teacher
engineer   88       9     999   engineer
doctor      0      99      99     doctor
nurse      87      66      55      nurse

In [197]:
## multi-indexing
## Index Levels
outside = ['G1',"G1",'G1',"G2","G2",'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [199]:
list((zip(outside,inside)))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [202]:
print("\ntuple pairs after the zip and list command\n",'-'*32,sep='')
print(hier_index)

tuple pairs after the zip and list command
--------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [210]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\n index hierarchy\n",'-'*45)
print(hier_index)

 index hierarchy
 ---------------------------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [212]:
print("\n index hierarchy\n",'-'*45)
print(type(hier_index))

 index hierarchy
 ---------------------------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [214]:
print("\n creating a data frame from a multi index\n",'-'*35)
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)),index=hier_index,columns=["A","B","C"])
df1

 creating a data frame from a multi index
 -----------------------------------

        A    B    C
G1 1  1.0 -0.0 -1.0
   2  0.0  1.0  1.0
   3 -0.0 -1.0  1.0
G2 1  0.0  0.0 -0.0
   2  1.0  0.0  2.0
   3  1.0  1.0 -2.0

In [215]:
df1.loc["G1"]

     A    B    C
1  1.0 -0.0 -1.0
2  0.0  1.0  1.0
3 -0.0 -1.0  1.0

In [217]:
df1.loc['G1'].loc[3,["B","C"]]

B   -1.0
C    1.0
Name: 3, dtype: float64

In [218]:
df1.loc['G1'].iloc[2,[1,2]]

B   -1.0
C    1.0
Name: 3, dtype: float64

In [219]:
## l1 = [a,a,a,b,b,b,c,c,c], l2 = [1,2,3,1,2,3,1,2,3], l3 [1,2,3,4,5,6,7,8,9]  and create multi index9*4 from random

In [221]:
l1 = ["A","A","A","B","B","B","C","C","C"]
l2 = [1,2,3,1,2,3,1,2,3]
l3 = [1,2,3,4,5,6,7,8,9]

hire_index = list(zip(l1,l2,l3))

In [222]:
hire_index

[('A', 1, 1),
 ('A', 2, 2),
 ('A', 3, 3),
 ('B', 1, 4),
 ('B', 2, 5),
 ('B', 3, 6),
 ('C', 1, 7),
 ('C', 2, 8),
 ('C', 3, 9)]

In [223]:
hire_index = pd.MultiIndex.from_tuples(hire_index)
print(hire_index)

MultiIndex([('A', 1, 1),
            ('A', 2, 2),
            ('A', 3, 3),
            ('B', 1, 4),
            ('B', 2, 5),
            ('B', 3, 6),
            ('C', 1, 7),
            ('C', 2, 8),
            ('C', 3, 9)],
           )

In [226]:
print("\n creating a data frame from a multi index\n",'-'*35)
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(9,4)),index=hire_index,columns=[1,2,3,4])
df1

 creating a data frame from a multi index
 -----------------------------------

         1    2    3    4
A 1 1  0.0 -1.0  1.0  2.0
  2 2  1.0  1.0 -1.0 -1.0
  3 3 -1.0  1.0 -0.0  1.0
B 1 4 -1.0 -0.0  0.0  1.0
  2 5  0.0  0.0  0.0  0.0
  3 6 -1.0  0.0 -0.0 -0.0
C 1 7  0.0 -1.0 -0.0 -0.0
  2 8  0.0  1.0 -1.0  1.0
  3 9  2.0 -1.0 -1.0 -1.0

In [228]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df["States"] = "Aus","Ind","Nz".split()
df.set_index("States",inplace=True)

In [229]:
df

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  NaN  2
[Nz]    NaN  NaN  3

In [230]:
## to drop any nan values from the data
print("\n to drop the nan values from the data\n",'-'*45)
print(df.dropna(axis=0))   ## axis = 0 to drop in a row label

 to drop the nan values from the data
 ---------------------------------------------
          A    B  C
States
Aus     1.0  5.0  1

In [231]:
df.dropna()

          A    B  C
States
Aus     1.0  5.0  1

In [232]:
df

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  NaN  2
[Nz]    NaN  NaN  3

In [233]:
## to drop permanently
df.dropna(inplace=True)

In [234]:
df

          A    B  C
States
Aus     1.0  5.0  1

In [235]:
df

          A    B  C
States
Aus     1.0  5.0  1

In [236]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df["States"] = "Aus","Ind","Nz".split()
df.set_index("States",inplace=True)

In [237]:
df

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  NaN  2
[Nz]    NaN  NaN  3

In [240]:
## to drop a column level
df.dropna(axis=1)    ## axis = 1 to drop column level

        C
States
Aus     1
Ind     2
[Nz]    3

In [242]:
#Require that many non-NA values
df.dropna(thresh = 2)

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  NaN  2

In [246]:
#Require that many non-NA values
df.dropna(thresh = 1)

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  NaN  2
[Nz]    NaN  NaN  3

In [247]:
#Require that many non-NA values
df.dropna(thresh = 3)

          A    B  C
States
Aus     1.0  5.0  1

In [248]:
#Require that many non-NA values
df.dropna(thresh = 4)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [251]:
#Require that many non-NA values
df.dropna(thresh = 2,axis=1)

          A  C
States
Aus     1.0  1
Ind     2.0  2
[Nz]    NaN  3